/*************************************************************************************/
/*************************************** 2018.4.11 ***********************************/
/*****************************          Jerry Zheng           ************************/
/**************************** Beijing Insititute of Technology ***********************/
/*************************************************************************************/

//伪代码给出transform()函数的用法以及说明

//具体变换函数
//int func1(){}
//int func2(){}
//
//int main()
//{
//	int a[5] = { 1, 2, 3, 4, 5 };
//	vector<int>v1(a, a + 5);
//	vector<int>v2(5);
//	transform(v1.begin(), v1.end(), v1.begin(), func1);
//	//v1调用一元函数func1修改自己，返回到v1
//	transform(v1, begin(), v1.end(), v2.begin(), func1);
//	//v1调用一元函数func1修改自己，返回到v2
//	/*如果v2的声明语句是vector<int>v2;那么transform函数应该这么写：
//	transform(v1.begin(), v1.end(), back_inserter(v2), func1);*/
//}