/*************************************************************************************/
/*************************************** 2018.4.13 ***********************************/
/*****************************          jerry zheng           ************************/
/**************************** beijing insititute of technology ***********************/
/*************************************************************************************/

//伪代码展示nth_element的作用
//其实nth_element相比于sort和partial_sort相比，节约了更多的资源，目标更明确

//vector<int>v(a, a + 9);
//nth_element(v.begin(), v.begin() + 2, v.end(), greater<int>());
///*寻找v中第三大元素*/
//vector<int>::iterator it = v.begin() + 2;
//cout << *it;