///*************************************************************************************/
///*************************************** 2018.4.13 ***********************************/
///*****************************          jerry zheng           ************************/
///**************************** beijing insititute of technology ***********************/
///*************************************************************************************/
//
////利用partial_sort取整型向量最小的4个元素
//
//#include "stdafx.h"
//
//int main()
//{
//	int a[] = { 110, 1, 3, 8, 5, 60, 4, 3, 5, 6 };
//	vector<int>v(a, a + 9);
//	cout << "原始向量数据：";
//	copy(v.begin(), v.end(), ostream_iterator<int>(cout, "\t"));
//	cout << endl;
//
//	partial_sort(v.begin(), v.begin() + 4, v.end());
//	cout << "partial_sort后(前4个元素升序排列):";
//	copy(v.begin(), v.end(), ostream_iterator<int>(cout, "\t"));
//	cout << endl;
//	
//	system("pause");
//	return 0;
//}