///*************************************************************************************/
///*************************************** 2018.4.13 ***********************************/
///*****************************          jerry zheng           ************************/
///**************************** beijing insititute of technology ***********************/
///*************************************************************************************/
//
////演示list容器排序的问题
//
//#include "stdafx.h"
//
//int main()
//{
//	int a[] = { 10, 1, 3, 9, 7, 6, 2, 4, 5, 8 };
//	list<int>l(a, a + 10);
//	//sort(l.begin(),l.end())是错误的
//	/*list容器不能使用sort通用排序算法，因为sort需要的是随机迭代器，方便排序算法中的数据交换，
//	但是list提供的是双向迭代器。所以想要排序，只能够使用list类本身的sort函数，如果需要降序，
//	则：l.sort(greater<int>())*/
//	/*因此，对于list容器的部分排序，最好的方案是把list的元素扔到vector里面，之后再回去*/
//	l.sort();
//	copy(l.begin(), l.end(), ostream_iterator<int>(cout, "\t"));
//
//	system("pause");
//	return 0;
//}