///*************************************************************************************/
///*************************************** 2018.4.13 ***********************************/
///*****************************          jerry zheng           ************************/
///**************************** beijing insititute of technology ***********************/
///*************************************************************************************/
//
////利用sort()函数实现数组降序排列
////如果想要升序排列，直接调用：sort(v.begin(),v.end())即可,但是降序不行
////降序的话必须通过自定义函数，调用第二个sort()参数列表，但也有更简便方式
//
//#include "stdafx.h"
//
//bool myless(int &m, int &n)
//{
//	return m > n;
//}
//
//int main()
//{
//	int a[] = { 1,8,6,10,4 };
//	vector<int>v(a, a + 5);
//	//sort(v.begin(), v.end(), myless);
//	//如果不采用myless自定义函数，可以采用greater二元函数：
//	sort(v.begin(), v.end(), greater<int>());
//	cout << "降序排列结果是：";
//	copy(v.begin(), v.end(), ostream_iterator<int>(cout, "\t"));
//	system("pause");
//	return 0;
//}