/*************************************************************************************/
/*************************************** 2018.3.28 ***********************************/
/*****************************          Jerry Zheng           ************************/
/**************************** Beijing Insititute of Technology ***********************/
/*************************************************************************************/


#include<iostream>
using namespace std;
//引入一元多项式之单链表实现的头文件
/*#include "poly_exe.h"
using namespace std;

int main()
{
	//声明一元多项式单链表
	Linklist<int> p1, p2, p3;
	cout << "请按指数由小到大的顺序定义多项式A(x):" << endl;
	p1.Init();
	cout << "输入的多项式A(x)为:";
	p1.Print();
	cout << "\n请按指数由小到大的顺序定义多项式B(x):" << endl;
	p2.Init();
	cout << "输入的多项式B(x)为:";
	p2.Print();
	//一元多项式相加
	p3 = p1 + p2;
	cout << "\n多项式A(x)和多项式B(x)的和为:" << endl;
	p3.Print();
	return 0;
}*/