///*************************************************************************************/
///*************************************** 2018.4.18 ***********************************/
///*****************************          Jerry Zheng           ************************/
///**************************** Beijing Insititute of Technology ***********************/
///*************************************************************************************/
//
////将shared_ptr作为容器的元素，本程序演示vector<shared_ptr<T>>
//
//#include "stdafx.h"
//
//using namespace std;
//
//int main()
//{
//	typedef vector<shared_ptr<int>> vs;
//	vs v(10);
//	//元素被初始化为空指针
//
//	int ni = 0;
//	for (auto pos = v.begin(); pos != v.end(); ++pos)
//	{
//		(*pos) = make_shared<int>(++ni);	//使用工厂函数赋值
//		cout << *(*pos) << ", ";	//输出值
//	}
//	cout << endl;
//
//	shared_ptr<int> p = v[9];
//	*p = 100;
//	cout << *v[9] << endl;
//
//	system("pause");
//	return 0;
//}